# Brewfile — declarative macOS package management
# Usage: brew bundle install --file=~/Brewfile --no-lock

# ============================================================================
# Taps
# ============================================================================
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "tw93/tap"

# ============================================================================
# Core CLI Tools
# ============================================================================
brew "git"
brew "gh"
brew "coreutils"
brew "findutils"
brew "make"
brew "cmake"
brew "ninja"
brew "just"

# ============================================================================
# Shell & Terminal
# ============================================================================
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "lsd"
brew "btop"
brew "htop"
brew "ncdu"
brew "tree"
brew "watch"
brew "pv"
brew "tmux"
brew "zellij"

# ============================================================================
# Text & Spelling
# ============================================================================
brew "aspell"
brew "hunspell"

# ============================================================================
# Git & VCS
# ============================================================================
brew "git-lfs"
brew "tig"

# ============================================================================
# Editors
# ============================================================================
brew "macvim"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp"]

# ============================================================================
# Languages & Runtimes
# ============================================================================
brew "pyenv"
brew "uv"
brew "node"
brew "gcc"
brew "llvm"
brew "zig"

# ============================================================================
# Networking & Security
# ============================================================================
brew "openssh"
brew "wget"
brew "nmap"
brew "iperf3"
brew "gnupg"
brew "pinentry-mac"
brew "pass"
brew "bcrypt"

# ============================================================================
# Media & Image Processing
# ============================================================================
brew "ffmpeg"
brew "imagemagick"
brew "gifsicle"
brew "dcraw"
brew "typst"

# ============================================================================
# Data & Science
# ============================================================================
brew "hdf5"
brew "gdal"
brew "apache-arrow"

# ============================================================================
# Misc Utilities
# ============================================================================
brew "parallel"
brew "p7zip"
brew "socat"
brew "tokei"
brew "gnu-units"
brew "tw93/tap/mole"

# ============================================================================
# Cask Apps
# ============================================================================
cask "alacritty"
cask "font-meslo-lg-nerd-font"
